Revit 2027 API
BuiltInFailures.WallFailures.FaceIsNoGoodForWall Property
 Defining face is not suitable for walls.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId FaceIsNoGoodForWall { get; }
Public Shared ReadOnly Property FaceIsNoGoodForWall As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ FaceIsNoGoodForWall {
	FailureDefinitionId^ get ();
}
static member FaceIsNoGoodForWall : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.WallFailures Class
Autodesk.Revit.DB Namespace